mock-example/src/test/resources/xml/AMRLiRT/ConfirmRatingRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:amr="http://sbrf.ru/NCP/AMRLIRT/" xmlns:con="http://sbrf.ru/NCP/AMRLIRT/ConfirmRatingRq/">
  <soap:Header/>
  <soap:Body>
    <amr:confirmRatingRq>
  <con:arg0>
    <con:ratingValue>3</con:ratingValue>
    <con:ratingId>string</con:ratingId>
    <con:model>string</con:model>
    <con:modelIntegrationId>string</con:modelIntegrationId>
    <con:requestor>
      <con:login>string</con:login>
      <con:lastName>string</con:lastName>
      <con:firstName>string</con:firstName>
      <!--Optional:-->
      <con:middleName>string</con:middleName>
      <con:division>string</con:division>
      <con:divisionCode>string</con:divisionCode>
      <!--Optional:-->
      <con:jobTitle>string</con:jobTitle>
      <!--Optional:-->
      <con:role>string</con:role>
    </con:requestor>
  </con:arg0>
  <!--Optional:-->
  <con:siebelMessage>anyType</con:siebelMessage>
</amr:confirmRatingRq>
  </soap:Body>
</soap:Envelope>